# LayoutRuleFixedDistance Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LayoutRuleFixedDistance Constructor
LayoutRuleFixedDistance Class See Also
---
Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LayoutRuleFixedDistance(
	double spacing,
	BeamSystemJustifyType justifyType
)
```

Visual Basic
---
```text
Public Sub New ( _
	spacing As Double, _
	justifyType As BeamSystemJustifyType _
)
```

Visual C++
---
```text
public:
LayoutRuleFixedDistance(
	double spacing,
	BeamSystemJustifyType justifyType
)
```

# ### Parameters
spacing
    Type: System..::..Double The value of spacing must be between 0 and 30000.
justifyType
    Type: Autodesk.Revit.DB..::..BeamSystemJustifyType The type of the justification, it's corresponding to the items in the element properties dialog.
# See Also
LayoutRuleFixedDistance Class
Autodesk.Revit.DB Namespace